app/controllers/health_histories_controller.rb

SELECT "health_histories".* FROM "health_histories"
---
  def index
    health_histories = HealthHistory.all

SELECT "health_histories".* FROM "health_histories" WHERE "health_histories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
	health_history = HealthHistory.find(params[:id])

SELECT "health_histories".* FROM "health_histories" WHERE "health_histories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_health_history
      @health_history = HealthHistory.find(params[:id])