app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" ORDER BY id
---
  def patient_details
	patients = Patient.order('id');

SELECT "patients"."id", "patients"."user_id", "patients"."license_no", "patients"."sex", "patients"."height", "patients"."weight", "patients"."marital_status", "patients"."emergency_contact_number", "patients"."emergency_contact_name", "patients"."emergency_contact_address", "patients"."emergency_contact_email" FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def personalDetails
	patient = Patient.select(:id,:user_id,:license_no,:sex,:height,:weight,:marital_status,:emergency_contact_number,:emergency_contact_name,:emergency_contact_address,:emergency_contact_email).find(params[:id])